import React from "react";

import AboutFundPage from "~/ui/components/about-fund-page/about-fund-page";
import { TSliderBaseProps } from "~/types/slider";
import AboutFundImgWrapper from "~/ui/components/about-fund-img-wrapper/about-fund-img-wrapper";

const mockHtml = `
  <p>
    Львівська національна академія мистецтв планувала 2022 рік для прориву в розвитку.
    Війна відтермінувала плани, але війна не має і не буде ставати на заваді місії Академії.
    Тому в липні 2022 року ми створили Благодійний Фонд «Друзі Львівської національної академії мистецтв»,
    який сприятиме реалізації Стратегії розвитку ЛНАМ через фінансування освітніх, мистецьких,
    дослідницьких, комунікаційних, інфраструктурних програм.
    Ключовою роллю Фонду є фандрейзинг та фінансування проєктів розвитку Академії,
    впливаючи на вибір ініціатив та форматів діяльності.
    Фонд виходить на культурний фронт і творитиме історію прориву.
  </p>

  <h2>Програми Благодійного фонду «Друзі ЛНАМ»</h2>

  <h3>Програма підтримки студентів та аспірантів</h3>
  <ul>
    <li>Стипендії на навчання та проживання в ЛНАМ</li>
    <li>Підтримка студентської та аспірантської мобільності</li>
    <li>Підтримка здоров'я студентів (здорове харчування, спортивна активність, ментальне здоров'я, допомога в кризових ситуаціях)</li>
    <li>Розвиток креативного підприємництва (бізнес-інкубатор, підтримка старт-апів)</li>
    <li>Підтримка проєктів студентського самоврядування, розвиток клубних форматів</li>
  </ul>

  <h3>Програма покращення умов навчання та проживання студентів</h3>
  <ul>
    <li>Оновлення будівель та освітнього простору (безпека, функціональність, інклюзивність, розвиток академістечка)</li>
    <li>Покращення умов проживання в гуртожитках</li>
    <li>Збереження та ревіталізація культурної спадщини</li>
    <li>Закупівля обладнання і матеріалів для мистецької освіти</li>
    <li>Оплата роботи натурників</li>
    <li>Підтримка цифровізації процесів</li>
  </ul>

  <h3>Програма підтримки викладачів та персоналу</h3>
  <ul>
    <li>Стипендії та погодинна оплата для гостьових викладачів</li>
    <li>Підтримка академічної, творчої та наукової мобільності викладачів</li>
    <li>Навчання та розвиток викладачів та персоналу (англійська мова, викладацька майстерність, універсальні навички)</li>
  </ul>

  <h3>Програма підтримки мистецьких, наукових і комунікаційних проєктів</h3>
  <ul>
    <li>Стипендії та погодинна оплата для гостьових викладачів</li>
    <li>Підтримка академічної, творчої та наукової мобільності викладачів</li>
    <li>Навчання та розвиток викладачів та персоналу (англійська мова, викладацька майстерність, універсальні навички)</li>
  </ul>

  <h3>Програма енергозбереження</h3>
  <ul>
    <li>Підтримка енергоаудиту та енергоменеджменту</li>
    <li>Модернізація будівель та обладнання</li>
    <li>Використання відновлювальних джерел енергії</li>
    <li>Сортування, ресайклінг та апсайклінг сміття</li>
  </ul>

  <p>
    Долучайтесь, запрошуйте своїх друзів, випускників і партнерів Академії на сторінку, діліться нашими новинами!
  </p>
`;

const sliderData: TSliderBaseProps = {
	slides: [
		{
			title: "Про Фонд",
			subtitle: "Благодійний Фонд 'Друзі ЛНАМ'",
			description:
				"Підтримка розвитку Львівської національної академії мистецтв", // треба
			imgSrc: "/slider/img-1.png",
		},
		{
			title: "Місія та цінності",
			subtitle: "Створення прориву на культурному фронті",
			description: "Фінансування освітніх, мистецьких та наукових програм", // треба
			imgSrc: "/slider/img-2.png",
		},
		{
			title: "Наші програми",
			subtitle: "Підтримка студентів та викладачів",
			description:
				"Розвиток креативного підприємництва та модернізація кампусу",
			imgSrc: "/slider/img-3.png",
		},
	],
	variant: "fullscreen",
};

const JSX_CONTENT = (
	<div className="space-y-6">
		<AboutFundImgWrapper
			src="/AboutFundPage-1.jpg"
			alt="Зустріч випускників та студентів - три молоді люди за столом з виробами на ярмарку"
			buttonText=""
			onButtonClick={() => {}}
		/>

		<AboutFundImgWrapper
			src="/AboutFundPage-2.jpg"
			alt="Кадри: Аліна Кіндяк - світла кімната з меблями та природним освітленням"
			buttonText=""
			onButtonClick={() => {}}
		/>

		<AboutFundImgWrapper
			src="/AboutFundPage-3.jpg"
			alt="Кадри: Аліна Кіндяк - світла кімната з меблями та природним освітленням"
			buttonText=""
			onButtonClick={() => {}}
		/>
	</div>
);

const SECTIONS = ["Інформація", "Фотографії"];

const Page = () => {
	return (
		<AboutFundPage
			slider={sliderData}
			htmlContent={mockHtml}
			jsxContent={JSX_CONTENT}
			sections={SECTIONS}
		/>
	);
};

export default Page;
