export type TStepToBuy = {
    title: string,
    description: string,
}
export type THowToBuyPage = {
    steps: TStepToBuy[]
}

export const HOW_TO_BUY_DATA:THowToBuyPage = {
    steps: [
        {
            title: "Перед покупкою",
            description: "Багато онлайн платформ надають можливість переглядати детальні фотографії та описи творів, а також читати відгуки попередніх покупців. Також можна звернутися до сертифікованих експертів для проведення аутентифікації.",
        },
        {
            title: "Оберіть товар",
            description: "Оберіть твір мистецтва, який вас зацікавив, та додайте його до кошика.",
        },
        {
            title: "Заповніть форму",
            description: "Заповніть форму з доставкою та оберіть зручний спосіб оплати.",
        },
        {
            title: "Отримайте підтвердження",
            description: "Після успішної оплати ви отримаєте підтвердження замовлення на вашу пошту.",
        },
        {
            title: "Очікуйте",
            description: "Наша команда відправить вам твір мистецтва в кращому вигляді, готовий прикрасити ваш простір або стати чудовим подарунком для ваших близьких.",
        },
        {
            title: "Доставка",
            description: "Після оплати товару ви отримаєте підтвердження замовлення на вашу пошту. Наша команда невдовзі зв'яжеться з вами, щоб узгодити деталі доставки. Твір мистецтва буде уважно запакований та доставлений до вказаної вами адреси за допомогою надійного транспортного партнера. Ми забезпечимо, щоб ваша посилка досягла вас в найкращому стані, готову прикрасити ваш житловий простір або стати особливим подарунком для ваших близьких.",
        },
        {
            title: "Повернення",
            description: "У випадку якщо ви вирішили повернути твір мистецтва, будь ласка, зверніть увагу на нашу політику повернення. Для повернення товару, зв'яжіться з нашим клієнтським сервісом, щоб узгодити умови повернення і повернення грошових коштів. Будь ласка, пам'ятайте, що деякі твори мистецтва можуть мати обмеження у поверненні через їх унікальний характер та особливості. Наша команда завжди готова допомогти вирішити будь-які питання, пов'язані з поверненням товару.\n",
        },

    ]
}