import {TQuestionAnswer, TQuestionCategory} from "~/types";

export type TQAPage = {
    frequentlyAskedQuestions: TQuestionAnswer[]
    questionsCategories: TQuestionCategory[]
}

export const MOCKED_QADATA:TQAPage = {
    frequentlyAskedQuestions: [
        {
          question: "Як я можу перевірити автентичність та якість мистецького твору перед покупкою?",
            answer: "Багато онлайн платформ надають можливість переглядати детальні фотографії та описи творів, а також читати відгуки попередніх покупців. Також можна звернутися до сертифікованих експертів для проведення аутентифікації."
        },
        {
          question: "Які умови повернення та обміну застосовуються до мистецьких творів, придбаних онлайн?",
            answer: "Перед покупкою важливо ознайомитися з умовами повернення та обміну, які встановлені платформою та продавцем. Більшість платформ надають покупцям певний строк на повернення товару в разі несумісності з описом або пошкодження."
        },
        {
          question: "Чи є можливість отримати додаткову інформацію про художника та його творчий шлях?",
            answer: "Так, багато платформ надають інформацію про художника, його біографію та попередні роботи. Деякі також дозволяють зв'язатися з художником безпосередньо для отримання додаткової інформації."
        },
    ],
    questionsCategories: [
        {
            name: "Про організацію",
            questions: [
                {
                    question: "Про організацію?",
                    answer: "Ми - ваш надійний провідник у світі вишуканого мистецтва. З натхненням дбаємо про те, щоб кожен елемент нашої колекції відображав унікальність та красу мистецтва. Поглиблені знання та висока експертиза допомагають нам пропонувати вам лише найкращі шедеври, які стануть справжньою окрасою вашого життя.",
                },
                {
                    question: "Хто ми? ",
                    answer: "Ми - ваш надійний провідник у світі вишуканого мистецтва. З натхненням дбаємо про те, щоб кожен елемент нашої колекції відображав унікальність та красу мистецтва. Поглиблені знання та висока експертиза допомагають нам пропонувати вам лише найкращі шедеври, які стануть справжньою окрасою вашого життя.",
                }
            ],

        },
        {
            name: "Доставка",
            questions: [
                {
                    question: "Про організацію?",
                    answer: "Ми - ваш надійний провідник у світі вишуканого мистецтва. З натхненням дбаємо про те, щоб кожен елемент нашої колекції відображав унікальність та красу мистецтва. Поглиблені знання та висока експертиза допомагають нам пропонувати вам лише найкращі шедеври, які стануть справжньою окрасою вашого життя.",
                },
                {
                    question: "Хто ми? ",
                    answer: "Ми - ваш надійний провідник у світі вишуканого мистецтва. З натхненням дбаємо про те, щоб кожен елемент нашої колекції відображав унікальність та красу мистецтва. Поглиблені знання та висока експертиза допомагають нам пропонувати вам лише найкращі шедеври, які стануть справжньою окрасою вашого життя.",
                }
            ],

        },
    ]
}